import { TreeNode } from '@rovna-internal/tree/core';

const mockKeys = [
  'key1',
  'key2',
  'key3',
  'key4',
  'key5',
  'key6',
  'key7',
  'key8',
  'key9',
  'key10',
];

const moreMockProjects = mockKeys.map((key, index) => {
  return {
    key: `${key}`,
    name: `Проект ${index + 1}`,
    value: `${key}`,
    children: [
      {
        key: `${key} 1 очередь`,
        value: `${key} 1 очередь`,
        children: [
          {
            key: `${key} 1 очередь 1 структура`,
            value: `${key} 1 очередь 1 структура`,
          },
          { key: `${key} 1 очередь 2 структура`, value: `${key} 1 очередь 2 структура` },
          { key: `${key} 1 очередь 3 структура`, value: `${key} 1 очередь 3 структура` },
          { key: `${key} 1 очередь 4 структура`, value: `${key} 1 очередь 4 структура` },
          { key: `${key} 1 очередь 5 структура`, value: `${key} 1 очередь 5 структура` },
        ],
      },
      {
        key: `${key} 2 очередь`,
        value: `${key} 2 очередь`,
        children: [
          { key: `${key} 2 очередь 1 структура`, value: `${key} 2 очередь 1 структура` },
          { key: `${key} 2 очередь 2 структура`, value: `${key} 2 очередь 2 структура` },
          { key: `${key} 2 очередь 3 структура`, value: `${key} 2 очередь 3 структура` },
          { key: `${key} 2 очередь 4 структура`, value: `${key} 2 очередь 4 структура` },
          { key: `${key} 2 очередь 5 структура`, value: `${key} 2 очередь 5 структура` },
        ],
      },
      {
        key: `${key} 3 очередь`,
        value: `${key} 3 очередь`,
        children: [
          { key: `${key} 3 очередь 1 структура`, value: `${key} 3 очередь 1 структура` },
          { key: `${key} 3 очередь 2 структура`, value: `${key} 3 очередь 2 структура` },
          { key: `${key} 3 очередь 3 структура`, value: `${key} 3 очередь 3 структура` },
          { key: `${key} 3 очередь 4 структура`, value: `${key} 3 очередь 4 структура` },
          { key: `${key} 3 очередь 5 структура`, value: `${key} 3 очередь 5 структура` },
        ],
      },
    ],
  };
});

export const projects: (TreeNode & { name: string })[] = [
  {
    key: 'Алхимово',
    name: 'Алхимово',
    value:
      'Это пример текста для проверки отображения компонента. Он помогает оценить перенос строк, отступы и доступную ширину содержимого.',
    children: [
      {
        key: 'Алхимово 2 очередь',
        value: '2 очередь',
        children: [
          { key: 'АЛХ_2 оч_10 ж.д', value: 'АЛХ_2 оч_10 ж.д' },
          { key: 'АЛХ_2 оч_11 ж.д', value: 'АЛХ_2 оч_11 ж.д' },
          { key: 'АЛХ_2 оч_12 ж.д', value: 'АЛХ_2 оч_12 ж.д' },
          { key: 'АЛХ_2 оч_13 ж.д', value: 'АЛХ_2 оч_13 ж.д' },
        ],
      },
      {
        key: 'Алхимово 3 очередь',
        value: '3 очередь',
        children: [
          { key: 'АЛХ_3 оч_10 ж.д', value: 'АЛХ_3 оч_10 ж.д' },
          { key: 'АЛХ_3 оч_11 ж.д', value: 'АЛХ_3 оч_11 ж.д' },
          { key: 'АЛХ_3 оч_12 ж.д', value: 'АЛХ_3 оч_12 ж.д' },
          { key: 'АЛХ_3 оч_13 ж.д', value: 'АЛХ_3 оч_13 ж.д' },
          { key: 'АЛХ_3 оч_14 ж.д', value: 'АЛХ_3 оч_14 ж.д' },
          { key: 'АЛХ_3 оч_15 ж.д', value: 'АЛХ_3 оч_15 ж.д' },
          { key: 'АЛХ_3 оч_16 ж.д', value: 'АЛХ_3 оч_16 ж.д' },
          { key: 'АЛХ_3 оч_17 ж.д', value: 'АЛХ_3 оч_17 ж.д' },
        ],
      },
      {
        key: 'Алхимово 1 очередь',
        value: '1 очередь',
        children: [
          {
            key: 'Алхимово 3 фаза',
            value: '3 Фаза',
            children: [
              { key: 'АЛХ_1 оч_10 ж.д', value: 'АЛХ_1 оч_10 ж.д' },
              { key: 'АЛХ_1 оч_11 ж.д', value: 'АЛХ_1 оч_11 ж.д' },
              { key: 'АЛХ_1 оч_12 ж.д', value: 'АЛХ_1 оч_12 ж.д' },
              { key: 'АЛХ_1 оч_13 ж.д', value: 'АЛХ_1 оч_13 ж.д' },
              { key: 'АЛХ_1 оч_14 ж.д', value: 'АЛХ_1 оч_14 ж.д' },
              { key: 'АЛХ_1 оч_15 ж.д', value: 'АЛХ_1 оч_15 ж.д' },
              { key: 'АЛХ_1 оч_16 ж.д', value: 'АЛХ_1 оч_16 ж.д' },
            ],
          },
        ],
      },
    ],
  },
  {
    key: 'Астрид',
    name: 'Тестовый проект',
    value: 'Астрид',
    children: [
      {
        key: 'Астрид 1 очередь',
        value: '1 очередь',
        children: [
          { key: 'АСТР_1 оч_10 ж.д', value: 'АСТР_1 оч_10 ж.д' },
          { key: 'АСТР_1 оч_11 ж.д', value: 'АСТР_1 оч_11 ж.д' },
          { key: 'АСТР_1 оч_12 ж.д', value: 'АСТР_1 оч_12 ж.д' },
          { key: 'АСТР_1 оч_13 ж.д', value: 'АСТР_1 оч_13 ж.д' },
          { key: 'АСТР_1 оч_14 ж.д', value: 'АСТР_1 оч_14 ж.д' },
          { key: 'АСТР_1 оч_15 ж.д', value: 'АСТР_1 оч_15 ж.д' },
          { key: 'АСТР_1 оч_16 ж.д', value: 'АСТР_1 оч_16 ж.д' },
        ],
      },
      {
        key: 'Астрид 2 очередь',
        value: '2 очередь',
        children: [
          { key: 'АСТР_2 оч_10 ж.д', value: 'АСТР_2 оч_10 ж.д' },
          { key: 'АСТР_2 оч_11 ж.д', value: 'АСТР_2 оч_11 ж.д' },
          { key: 'АСТР_2 оч_12 ж.д', value: 'АСТР_2 оч_12 ж.д' },
          { key: 'АСТР_2 оч_13 ж.д', value: 'АСТР_2 оч_13 ж.д' },
        ],
      },
      {
        key: 'Астрид 3 очередь',
        value: '3 очередь',
        children: [
          { key: 'АСТР_3 оч_10 ж.д', value: 'АСТР_3 оч_10 ж.д' },
          { key: 'АСТР_3 оч_11 ж.д', value: 'АСТР_3 оч_11 ж.д' },
          { key: 'АСТР_3 оч_12 ж.д', value: 'АСТР_3 оч_12 ж.д' },
          { key: 'АСТР_3 оч_13 ж.д', value: 'АСТР_3 оч_13 ж.д' },
          { key: 'АСТР_3 оч_14 ж.д', value: 'АСТР_3 оч_14 ж.д' },
          { key: 'АСТР_3 оч_15 ж.д', value: 'АСТР_3 оч_15 ж.д' },
          { key: 'АСТР_3 оч_16 ж.д', value: 'АСТР_3 оч_16 ж.д' },
          { key: 'АСТР_3 оч_17 ж.д', value: 'АСТР_3 оч_17 ж.д' },
        ],
      },
    ],
  },
  ...moreMockProjects,
];
