import React from 'react';

import { Tree } from '@rovna-ui/tree';

const defaultsNodes = [
  {
    key: 'Алхимово',
    value: 'Алхимово',
    children: [
      {
        key: 'Алхимово 1 очередь',
        value: '1 очередь',
        children: [
          {
            key: 'Алхимово 3 фаза',
            value: '3 Фаза',
            children: [
              { key: 'АЛХ_1 оч_10 ж.д', value: 'АЛХ_1 оч_10 ж.д' },
              { key: 'АЛХ_1 оч_11 ж.д', value: 'АЛХ_1 оч_11 ж.д' },
              { key: 'АЛХ_1 оч_12 ж.д', value: 'АЛХ_1 оч_12 ж.д' },
              { key: 'АЛХ_1 оч_13 ж.д', value: 'АЛХ_1 оч_13 ж.д' },
              { key: 'АЛХ_1 оч_14 ж.д', value: 'АЛХ_1 оч_14 ж.д' },
              { key: 'АЛХ_1 оч_15 ж.д', value: 'АЛХ_1 оч_15 ж.д' },
              { key: 'АЛХ_1 оч_16 ж.д', value: 'АЛХ_1 оч_16 ж.д' },
            ],
          },
        ],
      },
      {
        key: 'Алхимово 2 очередь',
        value: '2 очередь',
        children: [
          { key: 'АЛХ_2 оч_10 ж.д', value: 'АЛХ_2 оч_10 ж.д' },
          { key: 'АЛХ_2 оч_11 ж.д', value: 'АЛХ_2 оч_11 ж.д' },
          { key: 'АЛХ_2 оч_12 ж.д', value: 'АЛХ_2 оч_12 ж.д' },
          { key: 'АЛХ_2 оч_13 ж.д', value: 'АЛХ_2 оч_13 ж.д' },
        ],
      },
      {
        key: 'Алхимово 3 очередь',
        value: '3 очередь',
        children: [
          { key: 'АЛХ_3 оч_10 ж.д', value: 'АЛХ_3 оч_10 ж.д' },
          { key: 'АЛХ_3 оч_11 ж.д', value: 'АЛХ_3 оч_11 ж.д' },
          { key: 'АЛХ_3 оч_12 ж.д', value: 'АЛХ_3 оч_12 ж.д' },
          { key: 'АЛХ_3 оч_13 ж.д', value: 'АЛХ_3 оч_13 ж.д' },
          { key: 'АЛХ_3 оч_14 ж.д', value: 'АЛХ_3 оч_14 ж.д' },
          { key: 'АЛХ_3 оч_15 ж.д', value: 'АЛХ_3 оч_15 ж.д' },
          { key: 'АЛХ_3 оч_16 ж.д', value: 'АЛХ_3 оч_16 ж.д' },
          { key: 'АЛХ_3 оч_17 ж.д', value: 'АЛХ_3 оч_17 ж.д' },
        ],
      },
    ],
  },
  {
    key: 'Астрид',
    value: 'Астрид',
    children: [
      {
        key: 'Астрид 1 очередь',
        value: '1 очередь',
        children: [
          { key: 'АСТР_1 оч_10 ж.д', value: 'АСТР_1 оч_10 ж.д' },
          { key: 'АСТР_1 оч_11 ж.д', value: 'АСТР_1 оч_11 ж.д' },
          { key: 'АСТР_1 оч_12 ж.д', value: 'АСТР_1 оч_12 ж.д' },
          { key: 'АСТР_1 оч_13 ж.д', value: 'АСТР_1 оч_13 ж.д' },
          { key: 'АСТР_1 оч_14 ж.д', value: 'АСТР_1 оч_14 ж.д' },
          { key: 'АСТР_1 оч_15 ж.д', value: 'АСТР_1 оч_15 ж.д' },
          { key: 'АСТР_1 оч_16 ж.д', value: 'АСТР_1 оч_16 ж.д' },
        ],
      },
      {
        key: 'Астрид 2 очередь',
        value: '2 очередь',
        children: [
          { key: 'АСТР_2 оч_10 ж.д', value: 'АСТР_2 оч_10 ж.д' },
          { key: 'АСТР_2 оч_11 ж.д', value: 'АСТР_2 оч_11 ж.д' },
          { key: 'АСТР_2 оч_12 ж.д', value: 'АСТР_2 оч_12 ж.д' },
          { key: 'АСТР_2 оч_13 ж.д', value: 'АСТР_2 оч_13 ж.д' },
        ],
      },
      {
        key: 'Астрид 3 очередь',
        value: '3 очередь',
        children: [
          { key: 'АСТР_3 оч_10 ж.д', value: 'АСТР_3 оч_10 ж.д' },
          { key: 'АСТР_3 оч_11 ж.д', value: 'АСТР_3 оч_11 ж.д' },
          { key: 'АСТР_3 оч_12 ж.д', value: 'АСТР_3 оч_12 ж.д' },
          { key: 'АСТР_3 оч_13 ж.д', value: 'АСТР_3 оч_13 ж.д' },
          { key: 'АСТР_3 оч_14 ж.д', value: 'АСТР_3 оч_14 ж.д' },
          { key: 'АСТР_3 оч_15 ж.д', value: 'АСТР_3 оч_15 ж.д' },
          { key: 'АСТР_3 оч_16 ж.д', value: 'АСТР_3 оч_16 ж.д' },
          { key: 'АСТР_3 оч_17 ж.д', value: 'АСТР_3 оч_17 ж.д' },
        ],
      },
    ],
  },
];

export const TreePage = () => {
  return (
    <div style={{ display: 'flex', height: '500px' }}>
      <Tree
        onClick={e => {
          console.log(e);
        }}
        onEdit={p => {
          console.log(JSON.stringify(p, null, 2));
        }}
        onCheck={p => {
          console.log(JSON.stringify(p, null, 2));
        }}
        onChange={p => {
          console.log(JSON.stringify(p, null, 2));
        }}
        defaultNodes={defaultsNodes}
      />
    </div>
  );
};
